nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_flexcan.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.dsc_flexcan"
#endif

#if (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_6032) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_6032)
#define RXINTERMISSION (CAN_DBG1_CFSM(0x2f))
#define TXINTERMISSION (CAN_DBG1_CFSM(0x14))
#define BUSIDLE (CAN_DBG1_CFSM(0x02))
#define CBN_VALUE3 (CAN_DBG1_CBN(0x03))
#define DELAY_BUSIDLE (200)
#endif

#define IDEAL_SP_LOW (750U)
#define IDEAL_SP_MID (800U)
#define IDEAL_SP_HIGH (875U)
#define IDEAL_SP_FACTOR (1000U)

#define MAX_PROPSEG ((CAN_CTRL1_PROPSEG_MASK >> CAN_CTRL1_PROPSEG_SHIFT) + 1U)
#define MAX_PSEG1 ((CAN_CTRL1_PSEG1_MASK >> CAN_CTRL1_PSEG1_SHIFT) + 1U)
#define MAX_PSEG2 ((CAN_CTRL1_PSEG2_MASK >> CAN_CTRL1_PSEG2_SHIFT) + 1U)
#define MAX_RJW ((CAN_CTRL1_RJW_MASK >> CAN_CTRL1_RJW_SHIFT) + 1U)
#define MAX_PRESDIV ((CAN_CTRL1_PRESDIV_MASK >> CAN_CTRL1_PRESDIV_SHIFT) + 1U)
#define CTRL1_MAX_TIME_QUANTA (1U + MAX_PROPSEG + MAX_PSEG1 + MAX_PSEG2)
#define CTRL1_MIN_TIME_QUANTA (8U)

#define MAX_EPROPSEG ((CAN_CBT_EPROPSEG_MASK >> CAN_CBT_EPROPSEG_SHIFT) + 1U)
#define MAX_EPSEG1 ((CAN_CBT_EPSEG1_MASK >> CAN_CBT_EPSEG1_SHIFT) + 1U)
#define MAX_EPSEG2 ((CAN_CBT_EPSEG2_MASK >> CAN_CBT_EPSEG2_SHIFT) + 1U)
#define MAX_ERJW ((CAN_CBT_ERJW_MASK >> CAN_CBT_ERJW_SHIFT) + 1U)
#define MAX_EPRESDIV ((CAN_CBT_EPRESDIV_MASK >> CAN_CBT_EPRESDIV_SHIFT) + 1U)
#define CBT_MAX_TIME_QUANTA (1U + MAX_EPROPSEG + MAX_EPSEG1 + MAX_EPSEG2)
#define CBT_MIN_TIME_QUANTA (8U)

#define MAX_FPROPSEG (CAN_FDCBT_FPROPSEG_MASK >> CAN_FDCBT_FPROPSEG_SHIFT)
#define MAX_FPSEG1 ((CAN_FDCBT_FPSEG1_MASK >> CAN_FDCBT_FPSEG1_SHIFT) + 1U)
#define MAX_FPSEG2 ((CAN_FDCBT_FPSEG2_MASK >> CAN_FDCBT_FPSEG2_SHIFT) + 1U)
#define MAX_FRJW ((CAN_FDCBT_FRJW_MASK >> CAN_FDCBT_FRJW_SHIFT) + 1U)
#define MAX_FPRESDIV ((CAN_FDCBT_FPRESDIV_MASK >> CAN_FDCBT_FPRESDIV_SHIFT) + 1U)
#define FDCBT_MAX_TIME_QUANTA (1U + MAX_FPROPSEG + MAX_FPSEG1 + MAX_FPSEG2)
#define FDCBT_MIN_TIME_QUANTA (5U)

#define MAX_TDCOFF (CAN_FDCTRL_TDCOFF_MASK >> CAN_FDCTRL_TDCOFF_SHIFT)

#define MAX_CANFD_BAUDRATE (8000000U)
#define MAX_CAN_BAUDRATE (1000000U)

#if (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_9595) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_9595)
#define CAN_ESR1_FLTCONF_BUSOFF CAN_ESR1_FLTCONF(2U)
#endif

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#ifndef CAN_CLOCK_CHECK_NO_AFFECTS
/* If no define such MACRO, it mean that the CAN in current device have no clock affect issue. */
#define CAN_CLOCK_CHECK_NO_AFFECTS (true)
#endif /* CAN_CLOCK_CHECK_NO_AFFECTS */
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! @brief FlexCAN Internal State. */
enum _flexcan_state
{
    kFLEXCAN_StateIdle     = 0x0, /*!< MB/RxFIFO idle.*/
    kFLEXCAN_StateRxData   = 0x1, /*!< MB receiving.*/
    kFLEXCAN_StateRxRemote = 0x2, /*!< MB receiving remote reply.*/
    kFLEXCAN_StateTxData   = 0x3, /*!< MB transmitting.*/
    kFLEXCAN_StateTxRemote = 0x4, /*!< MB transmitting remote request.*/
    kFLEXCAN_StateRxFifo   = 0x5, /*!< RxFIFO receiving.*/
};

/*! @brief FlexCAN message buffer CODE for Rx buffers. */
enum _flexcan_mb_code_rx
{
    kFLEXCAN_RxMbInactive = 0x0, /*!< MB is not active.*/
    kFLEXCAN_RxMbFull     = 0x2, /*!< MB is full.*/
    kFLEXCAN_RxMbEmpty    = 0x4, /*!< MB is active and empty.*/
    kFLEXCAN_RxMbOverrun  = 0x6, /*!< MB is overwritten into a full buffer.*/
    kFLEXCAN_RxMbBusy     = 0x8, /*!< FlexCAN is updating the contents of the MB.*/
                                 /*!  The CPU must not access the MB.*/
    kFLEXCAN_RxMbRanswer = 0xA,  /*!< A frame was configured to recognize a Remote Request Frame */
                                 /*!  and transmit a Response Frame in return.*/
    kFLEXCAN_RxMbNotUsed = 0xF,  /*!< Not used.*/
};

/*! @brief FlexCAN message buffer CODE FOR Tx buffers. */
enum _flexcan_mb_code_tx
{
    kFLEXCAN_TxMbInactive     = 0x8, /*!< MB is not active.*/
    kFLEXCAN_TxMbAbort        = 0x9, /*!< MB is aborted.*/
    kFLEXCAN_TxMbDataOrRemote = 0xC, /*!< MB is a TX Data Frame(when MB RTR = 0) or */
                                     /*!< MB is a TX Remote Request Frame (when MB RTR = 1).*/
    kFLEXCAN_TxMbTanswer = 0xE,      /*!< MB is a TX Response Request Frame from */
                                     /*!  an incoming Remote Request Frame.*/
    kFLEXCAN_TxMbNotUsed = 0xF,      /*!< Not used.*/
};

/*!
 * @brief Data structure is used to calculate Flexcan Timing
 *
 */
typedef struct _flexcan_timing_calculation_para
{
    uint8_t u8MaxPhaseSeg1;  /*!< Max Phase 1 Segment in Quantuam */
    uint8_t u8MaxPhaseSeg2;  /*!< Max Phase 2 Segment in Quantuam */
    uint8_t u8MaxPropSeg;    /*!< Max Prop Segment in Quantum */
    uint8_t u8MaxRJumpWidth; /*!< Max Resync Jump Width in Quantum */
} flexcan_timing_calculation_para_t;

/*!
 * @brief Data structure assist for Denominator/Numerator calculation
 */
typedef struct _flexcan_calculator
{
    uint32_t u32Denominator;   /*!< Deniminator to be divided */
    uint16_t u16MinNumerator1; /*!< Min allowed value for numerator 1 */
    uint16_t u16MaxNumerator1; /*!< Max allowed value for numerator 1 */
    uint16_t u16MinNumerator2; /*!< Min allowed value for numerator 2 */
    uint16_t u16MaxNumerator2; /*!< Max allowed value for numerator 2 */
} flexcan_calcualtor_t;

/* Typedef for interrupt handler. */
typedef void (*flexcan_isr_t)(flexcan_handle_t *psHandle);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @name Debug Utilities
 * @{
 */
#if !defined(NDEBUG)
/*!
 * @brief Check if Message Buffer is occupied by Rx FIFO.
 *
 * This function check if Message Buffer is occupied by Rx FIFO.
 *
 * @param base FlexCAN peripheral base address.
 * @param u8MsgBufIdx The FlexCAN Message Buffer index.
 */
static bool FLEXCAN_IsMbOccupied(CAN_Type *base, uint8_t u8MsgBufIdx);
#endif

#if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
     (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
/*!
 * @brief Get the first valid Message buffer ID of give FlexCAN instance.
 *
 * This function is a helper function for Errata 5641 workaround.
 *
 * @param base FlexCAN peripheral base address.
 * @return The first valid Message Buffer Number.
 */
static uint8_t FLEXCAN_GetFirstValidMb(CAN_Type *base);
#endif

/* @} */

/*!
 * @brief Check if Message Buffer interrupt is enabled.
 *
 * This function check if Message Buffer interrupt is enabled.
 *
 * @param base FlexCAN peripheral base address.
 * @param u8MsgBufIdx The FlexCAN Message Buffer index.
 * @return TRUE if the index MB interrupt mask enabled, FALSE if the index MB interrupt mask disabled.
 *
 */
static bool FLEXCAN_IsMbIntEnabled(CAN_Type *base, uint8_t u8MsgBufIdx);

/*!
 * @brief Reset the FlexCAN Instance.
 *
 * Restores the FlexCAN module to reset state, notice that this function
 * will set all the registers to reset state so the FlexCAN module can not work
 * after calling this API.
 *
 * @param base FlexCAN peripheral base address.
 */
static void FLEXCAN_Reset(CAN_Type *base);

/*!
 * @brief Set Baud Rate of FlexCAN.
 *
 * This function set the baud rate of FlexCAN.
 *
 * @param base FlexCAN peripheral base address.
 * @param u32SrcClkHz Source Clock in Hz.
 * @param u32BaudRateBps_Bps Baud Rate in Bps.
 * @param sTimingConfig FlexCAN sTimingConfig.
 */
static void FLEXCAN_SetBaudRate(CAN_Type *base,
                                uint32_t u32SrcClkHz,
                                uint32_t u32BaudRateBps_Bps,
                                flexcan_timing_config_t sTimingConfig);

