nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.c
    /* Enable FlexCAN Module for configuration. */
    FLEXCAN_Enable(base, true);

    /* Reset to known status. */
    FLEXCAN_Reset(base);

    /* Save current CTRL1 value and enable to enter Freeze mode(enabled by default). */
    ctrl1Temp = base->CTRL1;

    /* Save current MCR value and enable to enter Freeze mode(enabled by default). */
    mcrTemp = base->MCR;

    /* Enable Loop Back Mode? */
    ctrl1Temp = (psConfig->bEnableLoopBack) ? (ctrl1Temp | CAN_CTRL1_LPB_MASK) : (ctrl1Temp & ~CAN_CTRL1_LPB_MASK);

    /* Enable Timer Sync? */
    ctrl1Temp = (psConfig->bEnableTimerSync) ? (ctrl1Temp | CAN_CTRL1_TSYN_MASK) : (ctrl1Temp & ~CAN_CTRL1_TSYN_MASK);

    /* Enable Listen Only Mode? */
    ctrl1Temp = (psConfig->bEnableListenOnlyMode) ? ctrl1Temp | CAN_CTRL1_LOM_MASK : ctrl1Temp & ~CAN_CTRL1_LOM_MASK;

    /* Set the maximum number of Message Buffers */
    mcrTemp = (mcrTemp & ~CAN_MCR_MAXMB_MASK) | CAN_MCR_MAXMB((uint32_t)psConfig->u8MaxMsgBufNum - 1U);

    /* Enable Self Wake Up Mode and configure the wake up source. */
    mcrTemp = (psConfig->bEnableSelfWakeup) ? (mcrTemp | CAN_MCR_SLFWAK_MASK) : (mcrTemp & ~CAN_MCR_SLFWAK_MASK);
    mcrTemp = (kFLEXCAN_WakeupSrcFiltered == psConfig->eWakeupSrc) ? (mcrTemp | CAN_MCR_WAKSRC_MASK) :
                                                                     (mcrTemp & ~CAN_MCR_WAKSRC_MASK);

    /* Enable Individual Rx Masking? */
    mcrTemp = (psConfig->bEnableIndividMask) ? (mcrTemp | CAN_MCR_IRMQ_MASK) : (mcrTemp & ~CAN_MCR_IRMQ_MASK);

    /* Disable Self Reception? */
    mcrTemp = (psConfig->bDisableSelfReception) ? mcrTemp | CAN_MCR_SRXDIS_MASK : mcrTemp & ~CAN_MCR_SRXDIS_MASK;

#if (defined(FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT)
    if (0 != FSL_FEATURE_FLEXCAN_INSTANCE_HAS_DOZE_MODE_SUPPORTn(base))
    {
        /* Enable Doze Mode? */
        mcrTemp = (psConfig->bEnableDoze) ? (mcrTemp | CAN_MCR_DOZE_MASK) : (mcrTemp & ~CAN_MCR_DOZE_MASK);
    }
#endif

    /* Write back CTRL1 Configuration to register. */
    base->CTRL1 = ctrl1Temp;

#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
    /* Enable to update in MCER. */
    base->CTRL2 |= CAN_CTRL2_ECRWRE_MASK;
    base->MECR &= ~CAN_MECR_ECRWRDIS_MASK;
#endif

    /* Write back MCR Configuration to register. */
    base->MCR = mcrTemp;

    /* Set the CAN FD Part */
    if (psConfig->psFDConfig != NULL)
    {
        uint32_t fdctrl = 0U;

        fdctrl = base->FDCTRL;

        /* Enable FD operation and set bitrate switch. */
        if (psConfig->psFDConfig->bEnableBitRateSwitch)
        {
            fdctrl |= CAN_FDCTRL_FDRATE_MASK;
        }
        else
        {
            fdctrl &= ~CAN_FDCTRL_FDRATE_MASK;
        }

        /* Setup the transmit delay to define a secondary sample point */
        if (psConfig->psFDConfig->bEnableBitRateSwitch && !(psConfig->bEnableLoopBack))
        {
            fdctrl =
                (fdctrl & ~CAN_FDCTRL_TDCEN_MASK) | CAN_FDCTRL_TDCEN(psConfig->psFDConfig->bEnableTxDelayCompensation);
            if ((psConfig->psFDConfig->sTimingConfig.u8PropSeg + psConfig->psFDConfig->sTimingConfig.u8PhaseSeg1 + 1U) <
                MAX_TDCOFF)
            {
                fdctrl = (fdctrl & ~CAN_FDCTRL_TDCOFF_MASK) |
                         CAN_FDCTRL_TDCOFF(psConfig->psFDConfig->sTimingConfig.u8PropSeg +
                                           psConfig->psFDConfig->sTimingConfig.u8PhaseSeg1 + 1U);
            }
            else
            {
                fdctrl = (fdctrl & ~CAN_FDCTRL_TDCOFF_MASK) | CAN_FDCTRL_TDCOFF(MAX_TDCOFF);
            }
        }

        /* Setup the region size for message buff */
        fdctrl = (fdctrl & ~CAN_FDCTRL_MBDSR0_MASK) | CAN_FDCTRL_MBDSR0(psConfig->psFDConfig->eMsgSize);
#if defined(CAN_FDCTRL_MBDSR1_MASK)
        fdctrl = (fdctrl & ~CAN_FDCTRL_MBDSR1_MASK) | CAN_FDCTRL_MBDSR1(psConfig->psFDConfig->eMsgSize);
#endif
#if defined(CAN_FDCTRL_MBDSR2_MASK)
        fdctrl = (fdctrl & ~CAN_FDCTRL_MBDSR2_MASK) | CAN_FDCTRL_MBDSR2(psConfig->psFDConfig->eMsgSize);
#endif
#if defined(CAN_FDCTRL_MBDSR3_MASK)
        fdctrl = (fdctrl & ~CAN_FDCTRL_MBDSR3_MASK) | CAN_FDCTRL_MBDSR3(psConfig->psFDConfig->eMsgSize);
#endif

        /* Enter Freeze Mode. */
        FLEXCAN_EnterFreezeMode(base);

        base->MCR |= CAN_MCR_FDEN_MASK;

        /* update the FDCTL register. */
        base->FDCTRL = fdctrl;

        /* Enable CAN FD ISO mode by default. */
        base->CTRL2 |= CAN_CTRL2_ISOCANFDEN_MASK;

        /* Exit Freeze Mode. */
        FLEXCAN_ExitFreezeMode(base);

        /* Extra bitrate setting for CANFD. */
        if (psConfig->psFDConfig->bEnableBitRateSwitch)
        {
            FLEXCAN_SetFDBaudRate(base, psConfig->u32ClkFreqHz, psConfig->psFDConfig->u32BaudRateBps,
                                  &psConfig->psFDConfig->sTimingConfig);
        }
    }

    /* Baud Rate Configuration.*/
    FLEXCAN_SetBaudRate(base, psConfig->u32ClkFreqHz, psConfig->u32BaudRateBps, psConfig->sTimingConfig);
}

void FLEXCAN_Deinit(CAN_Type *base)
{
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    uint32_t instance;
#endif
    /* Reset all Register Contents. */
    FLEXCAN_Reset(base);

    /* Disable FlexCAN module. */
    FLEXCAN_Enable(base, false);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    instance = FLEXCAN_GetInstance(base);
#if defined(FLEXCAN_PERIPH_CLOCKS)
    /* Disable FlexCAN serial clock. */
    CLOCK_DisableClock(s_flexcanPeriphClock[instance]);
#endif /* FLEXCAN_PERIPH_CLOCKS */
    /* Disable FlexCAN clock. */
    CLOCK_DisableClock(s_flexcanClock[instance]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

void FLEXCAN_GetDefaultConfig(flexcan_config_t *psConfig, uint32_t u32ClkFreqHz)
{
    /* Assertion. */
    assert(NULL != psConfig);

    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    /* Initialize FlexCAN Module config struct with default value. */
    psConfig->u32ClkFreqHz = u32ClkFreqHz;

    /* Default Configuration */
    psConfig->eClkSrc               = kFLEXCAN_ClkSrc0;
    psConfig->u32BaudRateBps        = 1000000U;
    psConfig->u8MaxMsgBufNum        = 16;
    psConfig->bEnableLoopBack       = false;
    psConfig->bEnableTimerSync      = true;
    psConfig->bEnableSelfWakeup     = false;
    psConfig->eWakeupSrc            = kFLEXCAN_WakeupSrcUnfiltered;
    psConfig->bEnableIndividMask    = false;
    psConfig->bDisableSelfReception = false;
    psConfig->bEnableListenOnlyMode = false;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_DOZE_MODE_SUPPORT)
    psConfig->bEnableDoze = false;
#endif
    /* Default protocol timing configuration, time quantum number is 10 (1 + u8PropSeg + u8PhaseSeg1 + u8PhaseSeg2 ). */
    psConfig->sTimingConfig.u8PhaseSeg1  = 4;
    psConfig->sTimingConfig.u8PhaseSeg2  = 3;
    psConfig->sTimingConfig.u8PropSeg    = 2;
    psConfig->sTimingConfig.u8RJumpWidth = 2;

    /* By default not setting the FD Config, Call FLEXCAN_GetFDDefaultConfig for FD Feature */
    psConfig->psFDConfig = NULL;
}

