nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.c
    // if (psTimingConfig->u8PhaseSeg1 > (psTimingPara->u8MaxPhaseSeg1 + psTimingPara->u8MaxPropSeg))
    if (u8TmpPhase1 > (psTimingPara->u8MaxPhaseSeg1 + psTimingPara->u8MaxPropSeg))
    {
        psTimingConfig->u8PhaseSeg1 = psTimingPara->u8MaxPhaseSeg1;
        psTimingConfig->u8PropSeg   = psTimingPara->u8MaxPropSeg;
    }
    // else if (psTimingConfig->u8PhaseSeg1 > psTimingPara->u8MaxPhaseSeg1)
    else if (u8TmpPhase1 > psTimingPara->u8MaxPhaseSeg1)
    {
        psTimingConfig->u8PhaseSeg1 = psTimingPara->u8MaxPhaseSeg1;
        // psTimingConfig->u8PropSeg   = psTimingConfig->u8PhaseSeg1 - psTimingPara->u8MaxPhaseSeg1;
        psTimingConfig->u8PropSeg = u8TmpPhase1 - psTimingPara->u8MaxPhaseSeg1;
    }
    else
    {
        psTimingConfig->u8PhaseSeg1 = u8TmpPhase1 - 1U;
        psTimingConfig->u8PropSeg   = 1U;
    }

    psTimingConfig->u8PhaseSeg2 =
        u32TqNum - psTimingConfig->u8PhaseSeg1 - psTimingConfig->u8PropSeg - 1U; /* Subtract the SYNC qutanum */

    if (psTimingConfig->u8PhaseSeg2 > psTimingPara->u8MaxPhaseSeg2)
    {
        return false;
    }

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    psTimingConfig->u8RJumpWidth = ((uint8_t)u32TqNum + (5U - 1U)) / 5U;

    if (psTimingConfig->u8RJumpWidth > psTimingPara->u8MaxRJumpWidth)
    {
        psTimingConfig->u8RJumpWidth = psTimingPara->u8MaxRJumpWidth;
    }

    return true;
}

bool FLEXCAN_GetNumerators(flexcan_calcualtor_t *psCalc, uint16_t *pu16Numerator1, uint16_t *pu16Numerator2)
{
    uint16_t u16TmpN1, u16TmpN2;

    u16TmpN1 = psCalc->u16MaxNumerator1;
    do
    {
        if ((psCalc->u32Denominator % u16TmpN1) != 0U)
        {
            continue;
        }

        u16TmpN2 = psCalc->u32Denominator / u16TmpN1;

        if ((u16TmpN2 >= psCalc->u16MinNumerator2) && (u16TmpN2 <= psCalc->u16MaxNumerator2))
        {
            *pu16Numerator1 = u16TmpN1;
            *pu16Numerator2 = u16TmpN2;
            return true;
        }
    } while (--u16TmpN1 >= psCalc->u16MinNumerator1);

    return false;
}

bool FLEXCAN_CalculateImprovedTimingValues(flexcan_timing_config_t *psTimingConfig,
                                           uint32_t u32BaudRateBps,
                                           uint32_t u32SrcClkHz)
{
    /* observe baud rate maximums. */
    assert(u32BaudRateBps <= MAX_CAN_BAUDRATE);

    uint16_t u16TqNum = 0;
    flexcan_calcualtor_t sCalc;
    flexcan_timing_calculation_para_t sTimingPara;

    /* Clock freq shall be divided by baud rate */
    if ((u32SrcClkHz % u32BaudRateBps) != 0U)
    {
        return false;
    }

    sCalc.u32Denominator   = u32SrcClkHz / u32BaudRateBps;
    sCalc.u16MaxNumerator1 = CTRL1_MAX_TIME_QUANTA;
    sCalc.u16MinNumerator1 = CTRL1_MIN_TIME_QUANTA;
    sCalc.u16MaxNumerator2 = MAX_PRESDIV;
    sCalc.u16MinNumerator2 = 1U;

    /* Get the numberators if able to get from given parameters */
    if (false == FLEXCAN_GetNumerators(&sCalc, &u16TqNum, &psTimingConfig->u16PreDivider))
    {
        return false;
    }

    /* Calculating the recommend segments*/
    sTimingPara.u8MaxPhaseSeg1  = MAX_PSEG1;
    sTimingPara.u8MaxPhaseSeg2  = MAX_PSEG2;
    sTimingPara.u8MaxPropSeg    = MAX_PROPSEG;
    sTimingPara.u8MaxRJumpWidth = MAX_RJW;

    return FELXCAN_GetRecommendSegments(psTimingConfig, u32BaudRateBps, u16TqNum, &sTimingPara);
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
bool FLEXCAN_FDCalculateImprovedTimingValues(flexcan_timing_config_t *psTimingConfig,
                                             flexcan_timing_config_t *psFDTimingConfig,
                                             uint32_t u32BaudRateBps,
                                             uint32_t u32FDBaudRateBps,
                                             uint32_t u32SrcClkHz)
{
    /* observe baud rate maximums */
    assert(u32BaudRateBps <= MAX_CAN_BAUDRATE);
    assert(u32FDBaudRateBps <= MAX_CANFD_BAUDRATE);

    uint16_t u16TqNum   = 0;
    uint16_t u16FDTqNum = 0;
    uint16_t u16TempDiv = 0;
    flexcan_calcualtor_t sCalc;
    flexcan_timing_calculation_para_t sTimingPara;

    if ((u32SrcClkHz % u32FDBaudRateBps) != 0U)
    {
        return false;
    }

    if ((u32SrcClkHz % u32BaudRateBps) != 0U)
    {
        return false;
    }

    /* u16TempDiv = u16TqNum * psTimingConfig->u16PreDivider */
    u16TempDiv = u32SrcClkHz / u32BaudRateBps;

    /* Calculate the timing for the FD mode data phase when BRS enabled */
    sCalc.u32Denominator   = u32SrcClkHz / u32FDBaudRateBps;
    sCalc.u16MaxNumerator1 = FDCBT_MAX_TIME_QUANTA;
    sCalc.u16MinNumerator1 = FDCBT_MIN_TIME_QUANTA;
    sCalc.u16MaxNumerator2 = MAX_FPRESDIV;
    sCalc.u16MinNumerator2 = 1U;

    for (; sCalc.u16MinNumerator2 <= MAX_FPRESDIV; sCalc.u16MinNumerator2++)
    {
        /* Get the numberators if able to get from given parameters */
        if (false == FLEXCAN_GetNumerators(&sCalc, &u16FDTqNum, &psFDTimingConfig->u16PreDivider))
        {
            return false;
        }
        /* Calculate the timing parameter for the FD mode arbitration phase  */
        if ((u16TempDiv % psFDTimingConfig->u16PreDivider) != 0U)
        {
            continue;
        }

        u16TqNum = u16TempDiv / psFDTimingConfig->u16PreDivider;
        if ((u16TqNum >= CBT_MIN_TIME_QUANTA) && (u16TqNum <= CBT_MAX_TIME_QUANTA))
        {
            /* Calculating the data phase segments*/
            sTimingPara.u8MaxPhaseSeg1  = MAX_FPSEG2;
            sTimingPara.u8MaxPhaseSeg2  = MAX_FPSEG2;
            sTimingPara.u8MaxPropSeg    = MAX_FPROPSEG;
            sTimingPara.u8MaxRJumpWidth = MAX_FRJW;

            if (false == FELXCAN_GetRecommendSegments(psFDTimingConfig, u32FDBaudRateBps, u16FDTqNum, &sTimingPara))
            {
                continue;
            }

            /* Data phase propagation Segment can be zero */
            if (psFDTimingConfig->u8PropSeg == 1U)
            {
                psFDTimingConfig->u8PropSeg = 0U;
                psFDTimingConfig->u8PhaseSeg1 += 1U;
            }

