nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.c
            /* Calculating the arbitration phase segments*/
            sTimingPara.u8MaxPhaseSeg1  = MAX_EPSEG1;
            sTimingPara.u8MaxPhaseSeg2  = MAX_EPSEG2;
            sTimingPara.u8MaxPropSeg    = MAX_EPROPSEG;
            sTimingPara.u8MaxRJumpWidth = MAX_ERJW;

            if (false == FELXCAN_GetRecommendSegments(psTimingConfig, u32BaudRateBps, u16TqNum, &sTimingPara))
            {
                continue;
            }
            /* Use the same value for FPRESDIV and EPRESDIV to minimize errors when processing FD frames */
            psTimingConfig->u16PreDivider = psFDTimingConfig->u16PreDivider;
            return true;
        }
    }

    return false;
}
#endif
/* @} */

/*!
 * @name Timing Configuration
 * @{
 */
void FLEXCAN_SetTimingConfig(CAN_Type *base, const flexcan_timing_config_t *psConfig)
{
    /* Assertion. */
    assert(NULL != psConfig);

    /* Enter Freeze Mode. */
    FLEXCAN_EnterFreezeMode(base);

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
    if (0 != FSL_FEATURE_FLEXCAN_INSTANCE_HAS_FLEXIBLE_DATA_RATEn(base))
    {
        /* Cleaning previous Timing Setting. */
        base->CBT &= ~(CAN_CBT_EPRESDIV_MASK | CAN_CBT_ERJW_MASK | CAN_CBT_EPSEG1_MASK | CAN_CBT_EPSEG2_MASK |
                       CAN_CBT_EPROPSEG_MASK);

        /* Updating Timing Setting according to configuration structure. */
        base->CBT |= (CAN_CBT_EPRESDIV(psConfig->u16PreDivider - 1U) | CAN_CBT_ERJW(psConfig->u8RJumpWidth - 1U) |
                      CAN_CBT_EPSEG1(psConfig->u8PhaseSeg1 - 1U) | CAN_CBT_EPSEG2(psConfig->u8PhaseSeg2 - 1U) |
                      CAN_CBT_EPROPSEG(psConfig->u8PropSeg - 1U));
    }
    else
    {
        /* Cleaning previous Timing Setting. */
        base->CTRL1 &= ~(CAN_CTRL1_PRESDIV_MASK | CAN_CTRL1_RJW_MASK | CAN_CTRL1_PSEG1_MASK | CAN_CTRL1_PSEG2_MASK |
                         CAN_CTRL1_PROPSEG_MASK);

        /* Updating Timing Setting according to configuration structure. */
        base->CTRL1 |= (CAN_CTRL1_PRESDIV(psConfig->u16PreDivider - 1U) | CAN_CTRL1_RJW(psConfig->u8RJumpWidth - 1U) |
                        CAN_CTRL1_PSEG1(psConfig->u8PhaseSeg1 - 1U) | CAN_CTRL1_PSEG2(psConfig->u8PhaseSeg2 - 1U) |
                        CAN_CTRL1_PROPSEG(psConfig->u8PropSeg - 1U));
    }
#else
    /* Cleaning previous Timing Setting. */
    base->CTRL1 &= ~(CAN_CTRL1_PRESDIV_MASK | CAN_CTRL1_RJW_MASK | CAN_CTRL1_PSEG1_MASK | CAN_CTRL1_PSEG2_MASK |
                     CAN_CTRL1_PROPSEG_MASK);

    /* Updating Timing Setting according to configuration structure. */
    base->CTRL1 |= (CAN_CTRL1_PRESDIV(psConfig->u16PreDivider - 1U) | CAN_CTRL1_RJW(psConfig->u8RJumpWidth - 1U) |
                    CAN_CTRL1_PSEG1(psConfig->u8PhaseSeg1 - 1U) | CAN_CTRL1_PSEG2(psConfig->u8PhaseSeg2 - 1U) |
                    CAN_CTRL1_PROPSEG(psConfig->u8PropSeg - 1U));
#endif

    /* Exit Freeze Mode. */
    FLEXCAN_ExitFreezeMode(base);
}

static void FLEXCAN_SetBaudRate(CAN_Type *base,
                                uint32_t u32SrcClkHz,
                                uint32_t u32BaudRateBps,
                                flexcan_timing_config_t sTimingConfig)
{
    /* FlexCAN timing setting formula:
     * u32Quantum = 1 + (PSEG1 + 1) + (PSEG2 + 1) + (PROPSEG + 1);
     */
    uint32_t u32Quantum = (1U + sTimingConfig.u8PhaseSeg1 + sTimingConfig.u8PhaseSeg2 + sTimingConfig.u8PropSeg);
    uint32_t u32PriDiv  = u32BaudRateBps * u32Quantum;

    /* Assertion: Desired baud rate is too high. */
    assert(u32BaudRateBps <= 1000000U);
    /* Assertion: Source clock should greater than baud rate * quantum. */
    assert(u32PriDiv <= u32SrcClkHz);

    if (0U == u32PriDiv)
    {
        u32PriDiv = 1;
    }

    u32PriDiv = (u32SrcClkHz / u32PriDiv);

    /* Desired baud rate is too low. */
    if (u32PriDiv > MAX_PRESDIV)
    {
        u32PriDiv = MAX_PRESDIV;
    }

    sTimingConfig.u16PreDivider = u32PriDiv;

    /* Update actual timing characteristic. */
    FLEXCAN_SetTimingConfig(base, &sTimingConfig);
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
void FLEXCAN_SetFDTimingConfig(CAN_Type *base, const flexcan_timing_config_t *psConfig)
{
    /* Assertion. */
    assert(NULL != psConfig);

    /* Enter Freeze Mode. */
    FLEXCAN_EnterFreezeMode(base);

    base->CBT |= CAN_CBT_BTF(1);
    /* Cleaning previous Timing Setting. */
    base->FDCBT &= ~(CAN_FDCBT_FPRESDIV_MASK | CAN_FDCBT_FRJW_MASK | CAN_FDCBT_FPSEG1_MASK | CAN_FDCBT_FPSEG2_MASK |
                     CAN_FDCBT_FPROPSEG_MASK);

    /* Updating Timing Setting according to configuration structure. */
    base->FDCBT |= (CAN_FDCBT_FPRESDIV(psConfig->u16PreDivider - 1U) | CAN_FDCBT_FRJW(psConfig->u8RJumpWidth - 1U) |
                    CAN_FDCBT_FPSEG1(psConfig->u8PhaseSeg1 - 1U) | CAN_FDCBT_FPSEG2(psConfig->u8PhaseSeg2 - 1U) |
                    CAN_FDCBT_FPROPSEG(psConfig->u8PropSeg));

    /* Exit Freeze Mode. */
    FLEXCAN_ExitFreezeMode(base);
}

static void FLEXCAN_SetFDBaudRate(CAN_Type *base,
                                  uint32_t u32SrcClkHz,
                                  uint32_t u32FDBaudRateBps,
                                  flexcan_timing_config_t *psTimingConfig)
{
    /* FlexCAN FD timing setting formula:
     * u32Quantum = 1 + (FPSEG1 + 1) + (FPSEG2 + 1) + FPROPSEG;
     */
    uint32_t u32Quantum = (1U + psTimingConfig->u8PhaseSeg1 + psTimingConfig->u8PhaseSeg2 + psTimingConfig->u8PropSeg);
    uint32_t u32PriDiv  = u32FDBaudRateBps * u32Quantum;

    /* Assertion: Desired baud rate is too high. */
    assert(u32FDBaudRateBps <= 8000000U);
    /* Assertion: Source clock should greater than baud rate * FLEXCAN_TIME_QUANTA_NUM. */
    assert(u32PriDiv <= u32SrcClkHz);

    if (0U == u32PriDiv)
    {
        u32PriDiv = 1;
    }

    u32PriDiv = (u32SrcClkHz / u32PriDiv);

    /* Desired baud rate is too low. */
    if (u32PriDiv > MAX_FPRESDIV)
    {
        u32PriDiv = MAX_FPRESDIV;
    }

    psTimingConfig->u16PreDivider = (uint16_t)u32PriDiv;

    /* Update actual timing characteristic. */
    FLEXCAN_SetFDTimingConfig(base, psTimingConfig);
}
#endif
/* @} */

/*!
 * @name Message Buffer Configuration
 * @{
 */

#if !defined(NDEBUG)
static bool FLEXCAN_IsMbOccupied(CAN_Type *base, uint8_t u8MsgBufIdx)
{
    uint8_t u8LastOccupiedMsgBuf;
    bool bFgRet;

    /* Is Rx FIFO enabled? */
    if (base->MCR & CAN_MCR_RFEN_MASK)
    {
        /* Get RFFN value. */
        u8LastOccupiedMsgBuf = (uint8_t)((base->CTRL2 & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
        /* Calculate the number of last Message Buffer occupied by Rx FIFO. */
        u8LastOccupiedMsgBuf = ((u8LastOccupiedMsgBuf + 1U) * 2U) + 5U;

#if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
     (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
        /* the first valid MB should be occupied by ERRATA 5461 or 5829. */
        u8LastOccupiedMsgBuf += 1U;
#endif
        bFgRet = (u8MsgBufIdx <= u8LastOccupiedMsgBuf);
    }
    else
    {
#if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
     (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
        if (0U == u8MsgBufIdx)
        {
            bFgRet = true;
        }
        else
#endif
        {
            bFgRet = false;
        }
    }

    return bFgRet;
}
#endif

#if ((defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) || \
     (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5829))
static uint8_t FLEXCAN_GetFirstValidMb(CAN_Type *base)
{
    uint8_t u8FirstValidMsgBufNum;

    if (0U != (base->MCR & CAN_MCR_RFEN_MASK))
    {
        u8FirstValidMsgBufNum = (uint8_t)((base->CTRL2 & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
        u8FirstValidMsgBufNum = ((u8FirstValidMsgBufNum + 1U) * 2U) + 6U;
    }
    else
    {
        u8FirstValidMsgBufNum = 0U;
    }

    return u8FirstValidMsgBufNum;
}
#endif

static bool FLEXCAN_IsMbIntEnabled(CAN_Type *base, uint8_t u8MsgBufIdx)
{
    /* Assertion. */
    assert(u8MsgBufIdx < (uint8_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base));

    uint32_t u32Flag = 1U;
    bool bFgRet      = false;

#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
    if (u8MsgBufIdx >= 32U)
    {
        bFgRet = (0U != (base->IMASK2 & (u32Flag << (u8MsgBufIdx - 32U))));
    }
    else
#endif
    {
        bFgRet = (0U != (base->IMASK1 & (u32Flag << u8MsgBufIdx)));
    }

    return bFgRet;
}

