nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_flexcan.c
    return status;
}

status_t FLEXCAN_TransferReceiveFifoNonBlocking(flexcan_handle_t *psHandle, flexcan_fifo_transfer_t *psFifoXfer)
{
    /* Assertion. */
    assert(NULL != psHandle);
    assert(NULL != psFifoXfer);

    status_t status;
    CAN_Type *base = psHandle->base;

    /* Check if Message Buffer is idle. */
    if ((uint8_t)kFLEXCAN_StateIdle == psHandle->u8RxFifoState)
    {
        psHandle->u8RxFifoState = (uint8_t)kFLEXCAN_StateRxFifo;

        /* Register Message Buffer. */
        psHandle->psRxFifoFrameBuf = psFifoXfer->psFrame;

        /* Enable Message Buffer Interrupt. */
        FLEXCAN_EnableMbInterrupts(base, (uint32_t)kFLEXCAN_RxFifoOverflowFlag | (uint32_t)kFLEXCAN_RxFifoWarningFlag |
                                             (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);

        status = kStatus_Success;
    }
    else
    {
        status = kStatus_FLEXCAN_RxFifoBusy;
    }

    return status;
}

void FLEXCAN_TransferAbortSend(flexcan_handle_t *psHandle, uint8_t u8MsgBufIdx)
{
    uint16_t timestamp;
    CAN_Type *base = psHandle->base;

    /* Assertion. */
    assert(NULL != psHandle);
    assert(u8MsgBufIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
#if !defined(NDEBUG)
    assert(!FLEXCAN_IsMbOccupied(base, u8MsgBufIdx));
#endif

/* Disable Message Buffer Interrupt. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
    uint64_t u64mask = 1;
    FLEXCAN_DisableMbInterrupts(base, u64mask << u8MsgBufIdx);
#else
    uint32_t u32mask = 1;
    FLEXCAN_DisableMbInterrupts(base, u32mask << u8MsgBufIdx);
#endif

    /* Update the TX frame 's time stamp by MB[u8MsgBufIdx].cs. */
    timestamp = (uint16_t)((base->MB[u8MsgBufIdx].CS & CAN_CS_TIME_STAMP_MASK) >> CAN_CS_TIME_STAMP_SHIFT);
    psHandle->u32TimeStamps[u8MsgBufIdx] = timestamp;

    /* Clean Message Buffer. */
    FLEXCAN_SetTxMbConfig(base, u8MsgBufIdx, true);

    psHandle->u8MsgBufStates[u8MsgBufIdx] = (uint8_t)kFLEXCAN_StateIdle;
}

void FLEXCAN_TransferAbortReceive(flexcan_handle_t *psHandle, uint8_t u8MsgBufIdx)
{
    CAN_Type *base = psHandle->base;

    /* Assertion. */
    assert(NULL != psHandle);
    assert(u8MsgBufIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
#if !defined(NDEBUG)
    assert(!FLEXCAN_IsMbOccupied(base, u8MsgBufIdx));
#endif

/* Disable Message Buffer Interrupt. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
    uint64_t u64mask = 1;
    FLEXCAN_DisableMbInterrupts(base, (u64mask << u8MsgBufIdx));
#else
    uint32_t u32mask = 1;
    FLEXCAN_DisableMbInterrupts(base, (u32mask << u8MsgBufIdx));
#endif

    /* Un-register psHandle. */
    psHandle->psMbFrameBufs[u8MsgBufIdx]  = NULL;
    psHandle->u8MsgBufStates[u8MsgBufIdx] = (uint8_t)kFLEXCAN_StateIdle;
}

void FLEXCAN_TransferAbortReceiveFifo(flexcan_handle_t *psHandle)
{
    /* Assertion. */
    assert(NULL != psHandle);

    CAN_Type *base = psHandle->base;

    /* Check if Rx FIFO is enabled. */
    if (0U != (base->MCR & CAN_MCR_RFEN_MASK))
    {
        /* Disable Rx Message FIFO Interrupts. */
        FLEXCAN_DisableMbInterrupts(base, (uint32_t)kFLEXCAN_RxFifoOverflowFlag | (uint32_t)kFLEXCAN_RxFifoWarningFlag |
                                              (uint32_t)kFLEXCAN_RxFifoFrameAvlFlag);

        /* Un-register psHandle. */
        psHandle->psRxFifoFrameBuf = NULL;
    }

    psHandle->u8RxFifoState = (uint8_t)kFLEXCAN_StateIdle;
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
status_t FLEXCAN_TransferFDSendNonBlocking(flexcan_handle_t *psHandle, flexcan_mb_transfer_t *psMsgBufXfer)
{
    /* Assertion. */
    assert(NULL != psHandle);
    assert(NULL != psMsgBufXfer);

    status_t status;
    CAN_Type *base = psHandle->base;
    assert(psMsgBufXfer->u8MsgBufIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
#if !defined(NDEBUG)
    assert(!FLEXCAN_IsMbOccupied(base, psMsgBufXfer->u8MsgBufIdx));
#endif

    /* Check if Message Buffer is idle. */
    if ((uint8_t)kFLEXCAN_StateIdle == psHandle->u8MsgBufStates[psMsgBufXfer->u8MsgBufIdx])
    {
        /* Distinguish transmit type. */
        if ((uint32_t)kFLEXCAN_FrameTypeRemote == psMsgBufXfer->psFrameFD->bitType)
        {
            psHandle->u8MsgBufStates[psMsgBufXfer->u8MsgBufIdx] = (uint8_t)kFLEXCAN_StateTxRemote;
        }
        else
        {
            psHandle->u8MsgBufStates[psMsgBufXfer->u8MsgBufIdx] = (uint8_t)kFLEXCAN_StateTxData;
        }

        if (kStatus_Success == FLEXCAN_WriteFDTxMb(base, psMsgBufXfer->u8MsgBufIdx,
                                                   (const flexcan_fd_frame_t *)(uint32_t)psMsgBufXfer->psFrameFD))
        {
/* Enable Message Buffer Interrupt. */
#if (defined(FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER)) && (FSL_FEATURE_FLEXCAN_HAS_EXTENDED_FLAG_REGISTER > 0)
            uint64_t u64mask = 1;
            FLEXCAN_EnableMbInterrupts(base, u64mask << psMsgBufXfer->u8MsgBufIdx);
#else
            uint32_t u32mask = 1;
            FLEXCAN_EnableMbInterrupts(base, u32mask << psMsgBufXfer->u8MsgBufIdx);
#endif

            status = kStatus_Success;
        }
        else
        {
            psHandle->u8MsgBufStates[psMsgBufXfer->u8MsgBufIdx] = (uint8_t)kFLEXCAN_StateIdle;
            status                                              = kStatus_Fail;
        }
    }
    else
    {
        status = kStatus_FLEXCAN_TxBusy;
    }

    return status;
}

status_t FLEXCAN_TransferFDReceiveNonBlocking(flexcan_handle_t *psHandle, flexcan_mb_transfer_t *psMsgBufXfer)
{
    /* Assertion. */
    assert(NULL != psHandle);
    assert(NULL != psMsgBufXfer);

    CAN_Type *base = psHandle->base;
    status_t status;
    assert(psMsgBufXfer->u8MsgBufIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
#if !defined(NDEBUG)
    assert(!FLEXCAN_IsMbOccupied(base, psMsgBufXfer->u8MsgBufIdx));
#endif

    /* Check if Message Buffer is idle. */
    if ((uint8_t)kFLEXCAN_StateIdle == psHandle->u8MsgBufStates[psMsgBufXfer->u8MsgBufIdx])
    {
        psHandle->u8MsgBufStates[psMsgBufXfer->u8MsgBufIdx] = (uint8_t)kFLEXCAN_StateRxData;

